# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
from numpy import random

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [7]:
series_1 = pd.Series(random.randint(1, 5, size=(100)))
series_2 = pd.Series(random.randint(1, 4, size=(100)))
series_3 = pd.Series(random.randint(10000, 30001, size=(100)))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [20]:
house = pd.DataFrame(pd.concat([series_1, series_2, series_3], axis=1))
house

    0  1      2
0   2  2  19380
1   2  3  11324
2   3  2  20270
3   4  1  26583
4   3  3  29241
.. .. ..    ...
95  1  3  22830
96  1  2  23083
97  4  1  11633
98  1  1  26190
99  4  2  19774

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [21]:
house.rename(columns={0: 'bedrs', 1: 'bathrs', 2:'price_sqr_meter'})

    bedrs  bathrs  price_sqr_meter
0       2       2            19380
1       2       3            11324
2       3       2            20270
3       4       1            26583
4       3       3            29241
..    ...     ...              ...
95      1       3            22830
96      1       2            23083
97      4       1            11633
98      1       1            26190
99      4       2            19774

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [22]:
bigcolumn = pd.DataFrame(pd.concat([series_1, series_2, series_3]))
bigcolumn

        0
0       2
1       2
2       3
3       4
4       3
..    ...
95  22830
96  23083
97  11633
98  26190
99  19774

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [23]:
bigcolumn.shape[0]

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [28]:
#bigcolumn['idx'] = range(0, 300)
#bigcolumn.set_index('idx')

bigcolumn.reset_index('idx')

         0
idx
0        2
1        2
2        3
3        4
4        3
..     ...
295  22830
296  23083
297  11633
298  26190
299  19774

[300 rows x 1 columns]